olliw42/stm32ll-lib/src/stdstm32-uarte.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTE_USE_UART1, UARTE_USE_UART1_PA9PA10, UARTE_USE_UART1_PB6PB7, UARTE_USE_UART1_PC4PC5
// #define UARTE_USE_UART2, UARTE_USE_UART2_PA2PA3, UARTE_USE_UART2_PD5PD6, UARTE_USE_UART2_PB3PB4, UARTE_USE_UART2_PA14PA15
// #define UARTE_USE_UART3, UARTE_USE_UART3_PB10PB11, UARTE_USE_UART3_PC10PC11, UARTE_USE_UART3_PB8PB9
// #define UARTE_USE_UART4, UARTE_USE_UART4_PC10PC11, UARTE_USE_UART4_PA0PA1
// #define UARTE_USE_UART5, UARTE_USE_UART5_PC12PD2
// #define UARTE_USE_UART6, UARTE_USE_UART6_PG14PG9
// #define UARTE_USE_UART7, UARTE_USE_UART7_PE8PE7, UARTE_USE_UART7_PF7PF6
// #define UARTE_USE_UART8, UARTE_USE_UART8_PE1PE0
// #define UARTE_USE_LPUART1, UARTE_USE_LPUART1_PA2PA3, UARTE_USE_LPUART1_PC1PC0
//
// #define UARTE_BAUD
//
// #define UARTE_USE_TX
// #define UARTE_TXBUFSIZE
// #define UARTE_USE_TX_ISR
// #define UARTE_USE_TX_DMA
// #define UARTE_INVERTED
//
// #define UARTE_USE_RX
// #define UARTE_RXBUFSIZE
//
// #define UARTE_IRQ_PRIORITY
//
// #define UARTE_USE_RXERRORCOUNT
//
// #define UARTE_RX_CALLBACK_FULL(c)
// #define UARTE_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTE_H
#define STDSTM32_UARTE_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTE_USE_TX_ISR) && (!defined UARTE_USE_TX)
  #error UARTE_USE_TX_ISR used without UARTE_USE_TX!
#endif
#if (defined UARTE_USE_RXERRORCOUNT) && (!defined UARTE_USE_RX)
  #error UARTE_USE_RXERRORCOUNT used without UARTE_USE_RX!
#endif

#ifdef UARTE_USE_TX_DMA
  #error UARTE_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTE_BAUD
  #define UARTE_BAUD             115200UL // 9600UL
#endif


#ifdef UARTE_USE_TX_ISR
  #ifndef UARTE_TXBUFSIZE
    #define UARTE_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTE_TXBUFSIZE < 2
    #error UARTE_TXBUFSIZE must be larger than 1 !
  #elif ((UARTE_TXBUFSIZE & (UARTE_TXBUFSIZE-1)) != 0)
    #error UARTE_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTE_TXBUFSIZEMASK  (UARTE_TXBUFSIZE-1)

  volatile char uarte_txbuf[UARTE_TXBUFSIZE];
  volatile uint16_t uarte_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uarte_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTE_USE_RX
  #ifndef UARTE_RXBUFSIZE
    #define UARTE_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTE_RXBUFSIZE < 2
    #error UARTE_RXBUFSIZE must be larger than 1 !
  #elif ((UARTE_RXBUFSIZE & (UARTE_RXBUFSIZE-1)) != 0)
    #error UARTE_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTE_RXBUFSIZEMASK  (UARTE_RXBUFSIZE-1)

  volatile char uarte_rxbuf[UARTE_RXBUFSIZE];
  volatile uint16_t uarte_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uarte_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTE_USE_RXERRORCOUNT
  volatile uint32_t uarte_errorcnt_rxnoise;
  volatile uint32_t uarte_errorcnt_rxframe;
  volatile uint32_t uarte_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTE_USE_UART1_REMAPPED || defined UARTE_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART2_REMAPPED || defined UARTE_USE_UART2_REMAPPED2 || defined UARTE_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTE_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UARTE_USE_UART1 || defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART1_PB6PB7 || defined UARTE_USE_UART1_PC4PC5
  #define UARTE_UARTx             USART1
  #ifdef UARTE_USE_UART1
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART1_PA9PA10
    #define UARTE_TX_IO           IO_PA9
    #define UARTE_RX_IO           IO_PA10
  #elif defined UARTE_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTE_TX_IO           IO_PB6
    #define UARTE_RX_IO           IO_PB7
  #elif defined UARTE_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTE_TX_IO           IO_PC4
    #define UARTE_RX_IO           IO_PC5
  #endif
  #ifndef STM32F0
    #define UARTE_IO_AF           IO_AF_7
  #else
    #ifdef UARTE_USE_UART1
      // user needs to specify UARTE_USE_IO_AF
    #elif defined UARTE_USE_UART1_PA9PA10
      #define UARTE_IO_AF         IO_AF_1
    #elif defined UARTE_USE_UART1_PB6PB7
      #define UARTE_IO_AF         IO_AF_0
    #else
      #error UARTE_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTE_IRQn              USART1_IRQn
  #define UARTE_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

